[
  {
    "name": "Bob's",
    "morning": true,
    "line": "Springfield/Lorton Lines",
    "location": "Just west of I-95 near the intersection of Old Keene Mill Road and Bland Street in Springfield, VA near the Springfield Town Center (aka Springfield Mall). The line itself is across the street from the parking by the gas station off of Old Keene Mill Road.",
    "description": "This location has undergone the test of time.  Although the construction of the \"Mixing Bowl\" disrupted this line for a short time, it is currently in full operation.  Because of some of the changes there are a few names to describe this location (Bob's, Springfield Plaza, Long John Silvers, Chi Chi's).  All names are actually the same slug line. There are two slug lines that operate out of the commuter lot. Line #1: L’Enfant Plaza and 14th street. Line #2: 18th Street locations (sometimes called Memorial Bridge).",
    "map": {"lat": 38.77983520000001, "lng": -77.18770849999999},
    "hours": {"best":"7:00 - 8:00 a.m.", "good": "5:45 - 7:00 a.m."},
    "destinations": ["L’Enfant Plaza", "14th Street (all points)", "18th Street (Memorial Bridge area)", "23rd Street", "Union Station (One way - currently no return line. Must use another line in the afternoon)", "Navy Yard (Just emerging! Some drivers are picking up for the Navy Yard now)" ],
    "returningStations": ["Pentagon", "15th & H/14th & New York Ave", "Commerce Building", "L’Enfant Plaza"],
    "driver": "From Old Keene Mill Road heading East, drivers pull into the old Long John Silvers and circle around the back side.",
    "parking": "Commuter lot next to K-Mart  approx. 155 spaces. The commuter lot is located across the street from the slug lines between the First Union Bank and K-Mart. Commuter lot normally fills by 7:30 or 8:00 a.m."
  },
  {
    "name": "Braddock Road",
    "morning": true,
    "line": "Springfield/Lorton Lines",
    "location": "Along Braddock road (East Bound) from Ox Rd (123) to I-495.",
    "description": "Slugs will have Mark Center or Pentagon signs displayed.  Slugs will be standing at bus stops and/or other paved areas so that drivers can easily and safely move out of traffic to pick up riders.",
    "map": {"lat": 38.8255552, "lng": -77.3149424},
    "hours": {"best":"7:00 - 8:00 a.m.", "good": "5:45 - 7:00 a.m."},
    "destinations": ["Pentagon", "Mark Center"],
    "returningStations": ["Pentagon", "Mark Center", "Bob's"],
    "driver": "East bound Braddock Rd drivers who will pick up slugs as a courtesy and/or to utilize the HOV on I-395 N.",
    "parking": "No parking is needed because riders walk to Braddock Rd."
  },
  {
    "name": "Cardinal Forest Shopping Center",
    "morning": true,
    "line": "Springfield/Lorton Lines",
    "location": "Springfield, near the intersection of Old Keene Mill Road and Rolling Road.",
    "description": "The Cardinal Forest (occasionally called Rolling Road) slug line operates next to the Shell station on Old Keene Mill Road, across from the Cardinal Forest Shopping Area. Slugs stand a few yards from the bus stop, actually putting them on the edge of the Springfield Golf and Country Club parking lot.",
    "map": {"lat": 38.78091360000001, "lng": -77.2315221},
    "hours": {"best":"7:00 - 8:00 a.m.", "good": "6:00 - 7:00 a.m."},
    "destinations": ["Pentagon (almost exclusively)"],
    "returningStations": ["Pentagon", "14th & NY", "14th & Constitution", "L’Enfant Plaza", "19 & F Street"],
    "driver": "This is rather tricky, but cars pull into the Shell station and then maneuver to a paved area that connects the Shell station and the country club. This paved area marked \"No Drive\" is where the slugs are picked up. Drivers depart by driving through the country club parking lot and back onto Old Keene Mill Road.",
    "parking": "Parking: Commuter lot, limited (100 spaces). The lot is in the Cardinal Forest Shopping Center. Watch for the painted lines and the signs. Just as the Metro riders must do, you must walk across the street to the slug line."
  },
  {
    "name": "Daventry Subdivision",
    "morning": true,
    "line": "Springfield/Lorton Lines",
    "location": "Location: Near the intersection of Old Keene Mill Road and Hunter Village Drive in Springfield, VA.",
    "description": "The Daventry slug line is located in the Daventry Subdivision. The line has located about 50 yards south on Hunter Village Drive. Slugs wait on the right shoulder on northbound Hunter Village Rd.  The carpool location is marked with signage on the shoulder.",
    "map": {"lat": 38.77421085070885, "lng": -77.20681150003657},
    "hours": {"best":"5:30 -7:00 a.m.", "good": "7:00 -8:00 a.m."},
    "destinations": ["Pentagon"],
    "returningStations": ["Pentagon", "14th & NY, 14th & Constitution", "L’Enfant Plaza", "19th & F Street"],
    "driver": "Cars traveling north on Hunter Village Drive simply pull to the median island where the slugs are waiting. Otherwise, cars from Old Keene Mill Road must make a U-turn before pulling into the median because there isn’t a turnaround point once the road returns to a two-way street. Be sure to leave enough room for other cars to make a U-turn in front of you. They are not trying to \"cut in line,\" but are simply dropping off riders.",
    "parking": "Curbside parking is very limited. Park on the shoulder of Hunter Village Drive south of the intersection, but pay close attention to the No Parking signs!"
  },
  {
    "name": "Lorton VRE ",
    "morning": true,
    "line": "Springfield/Lorton Lines",
    "location": "Exit 163 off I-95 (Commuter Rail Station) Actual address is 8990 Lorton Station Blvd, Lorton, VA 22079 however, Yahoo maps does not place it there. Instead try 7999 Lorton Road, Lorton, VA  22079",
    "description": "The slug line is located just off Lorton Station Road at the Lorton VRE station. The line forms on the main road entering the Lorton VRE Station and commuter lot prior to the covered bus shelter. There is no dedicated slug-line at the Pentagon for return rides to this location. Most people who slug to the Pentagon or L'Enfant return to Lorton via bus or train.",
    "map": {"lat": 38.7050885, "lng": -77.22085240000001},
    "hours": {"best":"5:30 - 8:30 a.m.", "good": "5:30 - 8:30 a.m."},
    "destinations": ["Pentagon", "L'Enfant Plaza", "Crystal City", "Foggy Bottom", "Pentagon City", "Metro Center", "McPherson Square"],
    "returningStations": ["Pentagon"],
    "driver": "Drivers pick up slugs from the Lorton Fairfax Connector bus line located at the Pentagon Bus Depot (Platform P). Drivers call out \"Lorton VRE.\"",
    "parking": "Excellent. Commuter parking lot with 717 free parking spaces."
  },
  {
    "name": "Huntsman and Sydenstricker",
    "morning": true,
    "line": "Springfield/Lorton Lines",
    "note": "this line maybe out of operation due to the new Park and Ride Lot at Sydenstricker.",
    "location": "Springfield, near the intersection of Huntsman Boulevard and Sydenstricker Road.",
    "description": "Occasionally called Orange Hunt because of the proximity to the Orange Hunt School. Operates near the bus stop just north of the intersection of Huntsman Boulevard and Sydenstricker Road.",
    "map": {"lat": 38.7665709, "lng": -77.25325299999997},
    "hours": {"best":"5:30 - 7:00 a.m.", "good": "7:00 - 8:30 a.m."},
    "destinations": ["Pentagon", "Rosslyn"],
    "returningStations": ["Pentagon", "14th & NY", "14th & Constitution", "L’Enfant Plaza"],
    "driver": "Normally, drivers normally pick up slugs, heading north on Huntsman.",
    "parking": "Park on the shoulder of Huntsman south of intersection or on Sydenstriker near school. Pay close attention to the No Parking signs!"
  },
  {
    "name": "Rolling Valley Mall",
    "morning": true,
    "line": "Springfield/Lorton Lines",
    "location": "Springfield/Burke, in the commuter lot near the intersection of 9300 Old Keene Mill Road and Shiplett Boulevard.",
    "description": "Operates in the commuter lot next to the shopping center. Normally, slugs stand next to the bus stop in the center of the parking area.",
    "map": {"lat": 38.775857, "lng": -77.262958},
    "hours": {"best":"7:00 - 8:00 a.m.", "good": "5:45 - 7:00 a.m,  8:00 - 8:30 a.m."},
    "destinations": ["Pentagon (heaviest volume)", "Foggy Bottom (at the Metro station between 23rd and I Street)", "20th Street & L", "Crystal City", "14th and Constitution", "L’Enfant Plaza", "18th Street", "Rosslyn (Easy walk to Georgetown)"],
    "returningStations": ["Pentagon", "14th & NY", "14th & Constitution", "L’Enfant Plaza", "19th & F Street", "Rosslyn"],
    "driver": "Drivers pull into the lot from the west and circle around so that the slugs are on the passenger side. Cars then drive through the lot and back onto Old Keene Mill Road.",
    "parking": "Commuter lot. Excellent (628 spaces)"
  },
  {
    "name": "Saratoga Park and Ride",
    "morning": true,
    "line": "Springfield/Lorton Lines",
    "location": "Saratoga Park and Ride, Intersection of Barta Rd and Fairfax County Parkway, Springfield, VA 22153",
    "description": "this line is just forming.  Slugs and drivers use the Sydenstricker commuter lot but this new location is emerging.  The Saratoga lot has 2 bus routes to and from the Pentagon. They are Fairfax County Connector Routes 393 and 394. The Saratoga lot is very large and underutilized. It is also about half a mile from the Fairfax County Parkway and Rolling Road intersection. The two closest commuter lots to Saratoga are Sydenstricker and Gambrill. Both lots fill up early and there is little \"spill over\" parking in the adjoining neighborhoods. Most people are unaware of the Saratoga lot. From the Pentagon, coming home, Saratoga sluggers can use the same line for Sydenstricker and Rolling Valley (Springfield/Burke stop).",
    "map": {"lat": 38.7454376, "lng": -77.2101328},
    "hours": {"best":"Not determined yet", "good": "Not determined yet"},
    "destinations": ["Pentagon"],
    "returningStations": ["Pentagon"],
    "driver": "N/A",
    "parking": "N/A"
  },
  {
    "name": "Sydenstricker Commuter Lot",
    "morning": true,
    "line": "Springfield/Lorton Lines",
    "location": "West Springfield, near the intersection of Sydenstricker and Hooes Road (Hwy 640) adjacent to the Fairfax County Parkway (Hwy 7100).",
    "description": "West Springfield, near the intersection of Sydenstricker and Hooes Road (Hwy 640) adjacent to the Fairfax County Parkway (Hwy 7100). The Gambrill commuter lot located just to the east of the Sydenstricker lot is not used for slugging but for carpools.",
    "map": {"lat": 38.7551324, "lng": -77.2404064},
    "hours": {"best":"7:00 - 8:00 a.m.", "good": "5:45 - 7:00 a.m,  8:00 - 8:30 a.m."},
    "destinations": ["Pentagon", "Rosslyn"],
    "returningStations": ["Pentagon", "14th & Constitution", "L’Enfant Plaza"],
    "driver": "N/A",
    "parking": "N/A"
  },
  {
    "name": "Rt.123 and I95 ",
    "morning": true,
    "line": "Woodbridge/Dale City",
    "note": "The Tyson's Corner destination is just emerging as of October 2016. Very little information is available at this time.",
    "location": "The Rt. 123/I95 Commuter lot is located at the intersection of Rt. 123 and I95 (near exit 160)",
    "description": "This is a brand new slugging area that was created after the reduction in parking spaces at Potomac Mills Mall on February 14th, 2011.",
    "map": {"lat": 38.775857, "lng": -77.262958},
    "hours": {"best":"6:20 AM - 8:15 AM", "good": "6:00 AM - 9:40 AM"},
    "destinations": ["Tyson's Corner"],
    "returningStations": [],
    "driver": "N/A",
    "parking": "Excellent - 770 spaces. "
  }
]
